docs/site/pestova18_approac.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pestova18_approac_notat_music_piano_live_elect</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">pestova18_approac_notat_music_piano_live_elect</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3fd2480">Approaches to Notation in Music for Piano and Live Electronics: The Performer's Perspective</a>
<ul>
<li><a href="#org3ccb3e5">page 131</a></li>
<li><a href="#org0cb13a5">page 132</a></li>
<li><a href="#orgd5e61f6">page 133</a></li>
<li><a href="#orgc0c2f7b">page 138</a></li>
<li><a href="#org51e27d9">page 140</a></li>
<li><a href="#orgf5363bd">page 142</a></li>
<li><a href="#org229dbd4">page 147</a></li>
<li><a href="#org846e3b3">page 157 conclusions</a></li>
<li><a href="#org7d12ba1">page 158</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3fd2480" class="outline-2">
<h2 id="org3fd2480">Approaches to Notation in Music for Piano and Live Electronics: The Performer's Perspective</h2>
<div class="outline-text-2" id="text-org3fd2480">
</div>
<div id="outline-container-org3ccb3e5" class="outline-3">
<h3 id="org3ccb3e5">page 131</h3>
<div class="outline-text-3" id="text-org3ccb3e5">
<p>
Lack of unified notation is a major issue in electronic repertoire
</p>

<p>
"Like other forms of writing, a score for electroacoustic music is not a neutral means of representation but the expression of a system of relations; you have to understand the language to be able to read the text. But the notation of electroacoustic music is not based on a widely accepted system of signs; there are a number of dialects." Gregorio Garcia Karman
</p>
</div>
</div>
<div id="outline-container-org0cb13a5" class="outline-3">
<h3 id="org0cb13a5">page 132</h3>
<div class="outline-text-3" id="text-org0cb13a5">
<p>
The performer has to learn a new dialect for almost every new piece.
</p>

<p>
Score sometimes has more info than reasonable for page turns. This requires reduction which introduces other kinds of problems.
</p>

<p>
No unified terminology for the field of live electronic music.
</p>

<p>
Notation of electronic music has been an issue from the start
</p>
</div>
</div>
<div id="outline-container-orgd5e61f6" class="outline-3">
<h3 id="orgd5e61f6">page 133</h3>
<div class="outline-text-3" id="text-orgd5e61f6">
<p>
Two main problmes, one is that we don't have symbols to accurately reflect electronic sounds, and two is the graphical representation of sound.
</p>

<p>
One notation approach is to show the sound wave on a horizontal scale to try and synchronize with the shape of the envelope.
</p>
</div>
</div>
<div id="outline-container-orgc0c2f7b" class="outline-3">
<h3 id="orgc0c2f7b">page 138</h3>
<div class="outline-text-3" id="text-orgc0c2f7b">
<p>
Another type is to use traditional music notation symbols to represent the electronics part. But we don't have symbols that match up very well with the sounds the electronic part can create
</p>

<p>
Additionally if the parts are complex, this can make performance almost impossible because of page turns. It can work well as a study or analysis score.
</p>
</div>
</div>
<div id="outline-container-org51e27d9" class="outline-3">
<h3 id="org51e27d9">page 140</h3>
<div class="outline-text-3" id="text-org51e27d9">
<p>
Some graphical notation is helpful to simplify the learning process of the electronics, although it does not comunicate the sound by itself
</p>
</div>
</div>
<div id="outline-container-orgf5363bd" class="outline-3">
<h3 id="orgf5363bd">page 142</h3>
<div class="outline-text-3" id="text-orgf5363bd">
<p>
The graphic representation of the computer part is purely referential (Kojs)
</p>

<p>
It doesn't give enough info to perform the piece without the max patch
</p>
</div>
</div>
<div id="outline-container-org229dbd4" class="outline-3">
<h3 id="org229dbd4">page 147</h3>
<div class="outline-text-3" id="text-org229dbd4">
<p>
another approach is to provide cues that will trigger sounds in the electronics, most commonly done through a midi pedal. However this often does not prepare the performer for what the sound will be, and requires frequent playing with the electronics to understand the electronics part.
</p>
</div>
</div>
<div id="outline-container-org846e3b3" class="outline-3">
<h3 id="org846e3b3">page 157 conclusions</h3>
<div class="outline-text-3" id="text-org846e3b3">
<p>
There is no unified notation protocol or terminology.
</p>
</div>
</div>
<div id="outline-container-org7d12ba1" class="outline-3">
<h3 id="org7d12ba1">page 158</h3>
<div class="outline-text-3" id="text-org7d12ba1">
<p>
A possible solution is to have a study score in addition to a performance score
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
